Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
   + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatStarter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-createPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-createPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-deleteClinicalWorkflow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-deleteClinicalWorkflow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-formatOutput will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-formatOutput" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-initQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginClinvar will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginClinvar" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginConsequence will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginConsequence" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginGnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomadConstraint will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginGnomadConstraint" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomadOneKG will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginGnomadOneKG" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-qcNotes will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcNotes" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryGTF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryGTF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCFsubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCFsubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].aws_api_gateway_authorizer.svep_user_pool_authorizer will be created
  + resource "aws_api_gateway_authorizer" "svep_user_pool_authorizer" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "sbeacon-userpool-authorizer"
      + provider_arns                    = (known after apply)
      + region                           = "ap-southeast-3"
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.svep[0].aws_api_gateway_integration.batch-submit-options will be created
  + resource "aws_api_gateway_integration" "batch-submit-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.batch-submit-post will be created
  + resource "aws_api_gateway_integration" "batch-submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.qcnotes-get will be created
  + resource "aws_api_gateway_integration" "qcnotes-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.qcnotes-options will be created
  + resource "aws_api_gateway_integration" "qcnotes-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.qcnotes-post will be created
  + resource "aws_api_gateway_integration" "qcnotes-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-options will be created
  + resource "aws_api_gateway_integration" "vcfstats-options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-southeast-3"
      + request_templates      = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = (known after apply)
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.svep[0].aws_api_gateway_integration_response.batch-submit-options will be created
  + resource "aws_api_gateway_integration_response" "batch-submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.batch-submit-post will be created
  + resource "aws_api_gateway_integration_response" "batch-submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.qcnotes-get will be created
  + resource "aws_api_gateway_integration_response" "qcnotes-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.qcnotes-options will be created
  + resource "aws_api_gateway_integration_response" "qcnotes-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.qcnotes-post will be created
  + resource "aws_api_gateway_integration_response" "qcnotes-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-options will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method.batch-submit-options will be created
  + resource "aws_api_gateway_method" "batch-submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.batch-submit-post will be created
  + resource "aws_api_gateway_method" "batch-submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.qcnotes-get will be created
  + resource "aws_api_gateway_method" "qcnotes-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.qcnotes-options will be created
  + resource "aws_api_gateway_method" "qcnotes-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.qcnotes-post will be created
  + resource "aws_api_gateway_method" "qcnotes-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.submit-patch will be created
  + resource "aws_api_gateway_method" "submit-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.submit-post will be created
  + resource "aws_api_gateway_method" "submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-options will be created
  + resource "aws_api_gateway_method" "vcfstats-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-patch will be created
  + resource "aws_api_gateway_method" "vcfstats-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-post will be created
  + resource "aws_api_gateway_method" "vcfstats-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_method_response.batch-submit-options will be created
  + resource "aws_api_gateway_method_response" "batch-submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.batch-submit-post will be created
  + resource "aws_api_gateway_method_response" "batch-submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.qcnotes-get will be created
  + resource "aws_api_gateway_method_response" "qcnotes-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.qcnotes-options will be created
  + resource "aws_api_gateway_method_response" "qcnotes-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.qcnotes-post will be created
  + resource "aws_api_gateway_method_response" "qcnotes-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.results-get will be created
  + resource "aws_api_gateway_method_response" "results-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.results-options will be created
  + resource "aws_api_gateway_method_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-options will be created
  + resource "aws_api_gateway_method_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-patch will be created
  + resource "aws_api_gateway_method_response" "submit-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.submit-post will be created
  + resource "aws_api_gateway_method_response" "submit-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-options will be created
  + resource "aws_api_gateway_method_response" "vcfstats-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-patch will be created
  + resource "aws_api_gateway_method_response" "vcfstats-patch" {
      + http_method         = "PATCH"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_method_response.vcfstats-post will be created
  + resource "aws_api_gateway_method_response" "vcfstats-post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.svep[0].aws_api_gateway_resource.batch-submit will be created
  + resource "aws_api_gateway_resource" "batch-submit" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "batch-submit"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_resource.qcnotes will be created
  + resource "aws_api_gateway_resource" "qcnotes" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "qcnotes"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_resource.results will be created
  + resource "aws_api_gateway_resource" "results" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "results"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_resource.submit will be created
  + resource "aws_api_gateway_resource" "submit" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "submit"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
    }

  # module.svep[0].aws_api_gateway_resource.vcfstats will be created
  + resource "aws_api_gateway_resource" "vcfstats" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "vcfstats"
      + region      = "ap-southeast-3"
      + rest_api_id = (known after apply)
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.